
## Terraform plan for environment: `prep`

**Commit:** b623ee43775ecb99d96737f8b59592e27c4622e1


**API version:** release-v6.1.2
**CLI version:** release-v6.1.2
**Selfserve version:** release-v6.1.2
**Internal version:** release-v6.1.2

### Plan summary

`0 to add, 5 to change, 0 to destroy`

**📖 Reads**

```tf
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
```


----

<details data-gh-workflow="prep-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:65" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.2"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v6.1.2"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:65"
        name                       = "vol-app-prep-import-anondb"
      ~ revision                   = 65 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:65" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.2"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v6.1.2"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:65"
        name                       = "vol-app-prep-ni-compliance"
      ~ revision                   = 65 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:65" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.2"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v6.1.2"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:65"
        name                       = "vol-app-prep-populate-anondb"
      ~ revision                   = 65 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-sas-mi-extract:65" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.2"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "release-v6.1.2"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-sas-mi-extract:65"
        name                       = "vol-app-prep-sas-mi-extract"
      ~ revision                   = 65 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "batch:SubmitJob",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-removal:2",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-liquibase:2",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency-dlq:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-ntu:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-community-licences:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-generation:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-print:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-ecmt-accept:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-general:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-irhp-allocate:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-generation:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-print:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-print:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-psv-operator-list-export:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-remove-read-audit:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-resolve-payments:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-system-parameter:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-transxchange-consumer:59",
              + "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-default",
              + "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-liquibase",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "batch"
        }
    }

  # module.service.module.eventbridge.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id               = "arn:aws:iam::146997448015:policy/vol-app-prep-batch-scheduler-inline"
        name             = "vol-app-prep-batch-scheduler-inline"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "batch:SubmitJob"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-liquibase",
                          - "arn:aws:batch:eu-west-1:146997448015:job-queue/vol-app-prep-default",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-transxchange-consumer:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-system-parameter:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-sas-mi-extract:65",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-resolve-payments:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-remove-read-audit:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-psv-operator-list-export:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-print:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-print:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-generation:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-irhp-allocate:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-general:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-ecmt-accept:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-print:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-generation:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-community-licences:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-ntu:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency-dlq:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:65",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:65",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-liquibase:2",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:65",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-removal:2",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:59",
                          - "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:59",
                        ]
                      - Sid      = "batch"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Name" = "vol-app-prep-batch-scheduler-inline"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

```

</details>